In [1]:
#import os    
#os.environ['SPARK_HOME'] = 'D:\\Pyspark\\spark-3.1.1-bin-hadoop3.2'

In [1]:
import findspark
findspark.find()

'D:\\Pyspark\\spark-3.1.1-bin-hadoop3.2'

In [2]:
findspark.init()

In [3]:
import pyspark

In [4]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('practise').getOrCreate()

In [5]:
spark

In [6]:
df = spark.read.option('header', True).csv('updated_demographic.csv', inferSchema=True)

In [7]:
df.show()

+--------------+------------------+------+------------+---------------+--------------------------+--------------+
|participant_id|examination_status|gender|age_in_years|race_and_origin|race_and_origin_with_asian|six_months_gap|
+--------------+------------------+------+------------+---------------+--------------------------+--------------+
|         73557|                 2|     1|          69|              4|                         4|             1|
|         73558|                 2|     1|          54|              3|                         3|             1|
|         73559|                 2|     1|          72|              3|                         3|             2|
|         73560|                 2|     1|           9|              3|                         3|             1|
|         73561|                 2|     2|          73|              3|                         3|             1|
|         73562|                 2|     1|          56|              1|                         1|             1|
|         73563|                 2|     1|           5|              3|                         3|             2|
|         73564|                 2|     2|          61|              3|                         3|             2|
|         73565|                 1|     1|          42|              2|                         2|             2|
|         73566|                 2|     2|          56|              3|                         3|             1|
|         73567|                 2|     1|          65|              3|                         3|             2|
|         73568|                 2|     2|          26|              3|                         3|             2|
|         73569|                 1|     2|           5|              5|                         7|             2|
|         73570|                 2|     2|           9|              5|                         7|             1|
|         73571|                 2|     1|          76|              3|                         3|             1|
|         73572|                 2|     2|          15|              4|                         4|             1|
|         73573|                 2|     1|          15|              4|                         4|             1|
|         73574|                 2|     2|          33|              5|                         6|             1|
|         73575|                 2|     1|           1|              4|                         4|             1|
|         73576|                 2|     1|          16|              4|                         4|             2|
+--------------+------------------+------+------------+---------------+--------------------------+--------------+
only showing top 20 rows

In [8]:
type(df)

pyspark.sql.dataframe.DataFrame

In [9]:
#check schema
df.printSchema()

root
 |-- participant_id: integer (nullable = true)
 |-- examination_status: integer (nullable = true)
 |-- gender: integer (nullable = true)
 |-- age_in_years: integer (nullable = true)
 |-- race_and_origin: integer (nullable = true)
 |-- race_and_origin_with_asian: integer (nullable = true)
 |-- six_months_gap: integer (nullable = true)

In [10]:
##Another option
df_spark = spark.read.csv('updated_demographic.csv', header=True, inferSchema=True)

In [11]:
df_spark.printSchema()

root
 |-- participant_id: integer (nullable = true)
 |-- examination_status: integer (nullable = true)
 |-- gender: integer (nullable = true)
 |-- age_in_years: integer (nullable = true)
 |-- race_and_origin: integer (nullable = true)
 |-- race_and_origin_with_asian: integer (nullable = true)
 |-- six_months_gap: integer (nullable = true)

In [12]:
df_spark.show()

+--------------+------------------+------+------------+---------------+--------------------------+--------------+
|participant_id|examination_status|gender|age_in_years|race_and_origin|race_and_origin_with_asian|six_months_gap|
+--------------+------------------+------+------------+---------------+--------------------------+--------------+
|         73557|                 2|     1|          69|              4|                         4|             1|
|         73558|                 2|     1|          54|              3|                         3|             1|
|         73559|                 2|     1|          72|              3|                         3|             2|
|         73560|                 2|     1|           9|              3|                         3|             1|
|         73561|                 2|     2|          73|              3|                         3|             1|
|         73562|                 2|     1|          56|              1|                         1|             1|
|         73563|                 2|     1|           5|              3|                         3|             2|
|         73564|                 2|     2|          61|              3|                         3|             2|
|         73565|                 1|     1|          42|              2|                         2|             2|
|         73566|                 2|     2|          56|              3|                         3|             1|
|         73567|                 2|     1|          65|              3|                         3|             2|
|         73568|                 2|     2|          26|              3|                         3|             2|
|         73569|                 1|     2|           5|              5|                         7|             2|
|         73570|                 2|     2|           9|              5|                         7|             1|
|         73571|                 2|     1|          76|              3|                         3|             1|
|         73572|                 2|     2|          15|              4|                         4|             1|
|         73573|                 2|     1|          15|              4|                         4|             1|
|         73574|                 2|     2|          33|              5|                         6|             1|
|         73575|                 2|     1|           1|              4|                         4|             1|
|         73576|                 2|     1|          16|              4|                         4|             2|
+--------------+------------------+------+------------+---------------+--------------------------+--------------+
only showing top 20 rows

In [13]:
df_spark.columns

['participant_id',
 'examination_status',
 'gender',
 'age_in_years',
 'race_and_origin',
 'race_and_origin_with_asian',
 'six_months_gap']

In [14]:
df_spark.head()

Row(participant_id=73557, examination_status=2, gender=1, age_in_years=69, race_and_origin=4, race_and_origin_with_asian=4, six_months_gap=1)

In [15]:
#selecting a column
df_spark.select('participant_id').show(10)

+--------------+
|participant_id|
+--------------+
|         73557|
|         73558|
|         73559|
|         73560|
|         73561|
|         73562|
|         73563|
|         73564|
|         73565|
|         73566|
+--------------+
only showing top 10 rows

In [16]:
df_spark.select(['participant_id', 'gender']).show()

+--------------+------+
|participant_id|gender|
+--------------+------+
|         73557|     1|
|         73558|     1|
|         73559|     1|
|         73560|     1|
|         73561|     2|
|         73562|     1|
|         73563|     1|
|         73564|     2|
|         73565|     1|
|         73566|     2|
|         73567|     1|
|         73568|     2|
|         73569|     2|
|         73570|     2|
|         73571|     1|
|         73572|     2|
|         73573|     1|
|         73574|     2|
|         73575|     1|
|         73576|     1|
+--------------+------+
only showing top 20 rows

In [17]:
df_spark.dtypes

[('participant_id', 'int'),
 ('examination_status', 'int'),
 ('gender', 'int'),
 ('age_in_years', 'int'),
 ('race_and_origin', 'int'),
 ('race_and_origin_with_asian', 'int'),
 ('six_months_gap', 'int')]

In [18]:
df_spark.describe().toPandas() #toPandas() gives better visualization than show()

,summary,participant_id,examination_status,gender,age_in_years,race_and_origin,race_and_origin_with_asian,six_months_gap
0,count,10175,10175,10175,10175,10175,10175,10175
1,mean,78644.0,1.9644226044226045,1.5083046683046684,32.274299754299754,3.091891891891892,3.28982800982801,1.525995085995086
2,stddev,2937.4138285233153,0.1852431293855907,0.49995559617340146,24.630410253136994,1.2633047033277733,1.613240660729097,0.49934833686004887
3,min,73557,1,1,1,1,1,1
4,max,83731,2,2,85,5,7,2

In [19]:
#Adding columns
df_spark.withColumn('Age in months', df_spark['age_in_years'] * 12).toPandas() #not inplace

,participant_id,examination_status,gender,age_in_years,race_and_origin,race_and_origin_with_asian,six_months_gap,Age in months
0,73557,2,1,69,4,4,1,828
1,73558,2,1,54,3,3,1,648
2,73559,2,1,72,3,3,2,864
3,73560,2,1,9,3,3,1,108
4,73561,2,2,73,3,3,1,876
...,...,...,...,...,...,...,...,...
10170,83727,2,1,26,2,2,2,312
10171,83728,2,2,2,1,1,2,24
10172,83729,2,2,42,4,4,2,504
10173,83730,2,1,7,2,2,1,84
10174,83731,2,1,11,5,6,1,132

In [20]:
# Adding the column inplace
df_spark = df_spark.withColumn("age_in_months", df_spark['age_in_years']*12)

In [21]:
df_spark.toPandas()

,participant_id,examination_status,gender,age_in_years,race_and_origin,race_and_origin_with_asian,six_months_gap,age_in_months
0,73557,2,1,69,4,4,1,828
1,73558,2,1,54,3,3,1,648
2,73559,2,1,72,3,3,2,864
3,73560,2,1,9,3,3,1,108
4,73561,2,2,73,3,3,1,876
...,...,...,...,...,...,...,...,...
10170,83727,2,1,26,2,2,2,312
10171,83728,2,2,2,1,1,2,24
10172,83729,2,2,42,4,4,2,504
10173,83730,2,1,7,2,2,1,84
10174,83731,2,1,11,5,6,1,132

In [22]:
#Dropping the columns
df_spark = df_spark.drop('age_in_months')

In [23]:
df_spark.toPandas()

,participant_id,examination_status,gender,age_in_years,race_and_origin,race_and_origin_with_asian,six_months_gap
0,73557,2,1,69,4,4,1
1,73558,2,1,54,3,3,1
2,73559,2,1,72,3,3,2
3,73560,2,1,9,3,3,1
4,73561,2,2,73,3,3,1
...,...,...,...,...,...,...,...
10170,83727,2,1,26,2,2,2
10171,83728,2,2,2,1,1,2
10172,83729,2,2,42,4,4,2
10173,83730,2,1,7,2,2,1
10174,83731,2,1,11,5,6,1

In [24]:
#Rename the column

df_spark = df_spark.withColumnRenamed('age_in_years', 'age')

In [25]:
df_spark.toPandas()

,participant_id,examination_status,gender,age,race_and_origin,race_and_origin_with_asian,six_months_gap
0,73557,2,1,69,4,4,1
1,73558,2,1,54,3,3,1
2,73559,2,1,72,3,3,2
3,73560,2,1,9,3,3,1
4,73561,2,2,73,3,3,1
...,...,...,...,...,...,...,...
10170,83727,2,1,26,2,2,2
10171,83728,2,2,2,1,1,2
10172,83729,2,2,42,4,4,2
10173,83730,2,1,7,2,2,1
10174,83731,2,1,11,5,6,1

## Handle null values

In [26]:
spark_df = spark.read.csv('random_csv.csv', header=True, inferSchema=True)

In [27]:
spark_df.show()

+-------------+----+------+
|         Name| Age|Salary|
+-------------+----+------+
|Prakash Dahal|  21|  null|
|          SPR|null| 35000|
|          SCF|  22| 30000|
|          ABC|  25|  null|
|          PQR|null|  null|
|          XYZ|  24|  null|
|         null|  25| 37000|
+-------------+----+------+

In [28]:
spark_df.toPandas()

            Name   Age   Salary
0  Prakash Dahal  21.0      NaN
1            SPR   NaN  35000.0
2            SCF  22.0  30000.0
3            ABC  25.0      NaN
4            PQR   NaN      NaN
5            XYZ  24.0      NaN
6           None  25.0  37000.0

In [29]:
#Counting rows
spark_df.count()

7

In [30]:
spark_df.corr('Age', 'Salary')

-0.09484454838593365

In [31]:
spark_df.distinct().count()

7

In [32]:
spark_df.fillna({"Age":20}).show()

+-------------+---+------+
|         Name|Age|Salary|
+-------------+---+------+
|Prakash Dahal| 21|  null|
|          SPR| 20| 35000|
|          SCF| 22| 30000|
|          ABC| 25|  null|
|          PQR| 20|  null|
|          XYZ| 24|  null|
|         null| 25| 37000|
+-------------+---+------+

In [33]:
spark_df.fillna({"Age":20, "Name":"Unknown", "Salary":20000}).show()

+-------------+---+------+
|         Name|Age|Salary|
+-------------+---+------+
|Prakash Dahal| 21| 20000|
|          SPR| 20| 35000|
|          SCF| 22| 30000|
|          ABC| 25| 20000|
|          PQR| 20| 20000|
|          XYZ| 24| 20000|
|      Unknown| 25| 37000|
+-------------+---+------+

In [34]:
from pyspark.sql.functions import avg, count, col

In [35]:
#Selecting average of a column 
spark_df.select(avg("Age").alias('Average Age')).show()

+-----------+
|Average Age|
+-----------+
|       23.4|
+-----------+

In [37]:
spark_df.select(avg(col('Age')).alias("Average age")).show()

+-----------+
|Average age|
+-----------+
|       23.4|
+-----------+

In [38]:
spark_df.dropna().show()

+----+---+------+
|Name|Age|Salary|
+----+---+------+
| SCF| 22| 30000|
+----+---+------+

In [39]:
from pyspark.ml.feature import Imputer

In [44]:
#Filling with mean values
imputer = Imputer(strategy='mean', inputCols=['Age', 'Salary'], outputCols=['Imputed_Age', 'Imputed_Salary'])

In [45]:
imputer.fit(spark_df).transform(spark_df).show()

+-------------+----+------+-----------+--------------+
|         Name| Age|Salary|Imputed_Age|Imputed_Salary|
+-------------+----+------+-----------+--------------+
|Prakash Dahal|  21|  null|         21|         34000|
|          SPR|null| 35000|         23|         35000|
|          SCF|  22| 30000|         22|         30000|
|          ABC|  25|  null|         25|         34000|
|          PQR|null|  null|         23|         34000|
|          XYZ|  24|  null|         24|         34000|
|         null|  25| 37000|         25|         37000|
+-------------+----+------+-----------+--------------+

In [46]:
#All the above functions are not done inplace
spark_df.show()

+-------------+----+------+
|         Name| Age|Salary|
+-------------+----+------+
|Prakash Dahal|  21|  null|
|          SPR|null| 35000|
|          SCF|  22| 30000|
|          ABC|  25|  null|
|          PQR|null|  null|
|          XYZ|  24|  null|
|         null|  25| 37000|
+-------------+----+------+

In [65]:
from pyspark.sql.functions import when, isnan, count, col, isnull
import numpy as np

In [60]:
spark_df.withColumn('Salary', \
                   when(spark_df['Name']=="Prakash Dahal", 35000)\
                   .when(spark_df['Name'] == np.nan, 20000).otherwise(spark_df['Salary'])).show()

+-------------+----+------+
|         Name| Age|Salary|
+-------------+----+------+
|Prakash Dahal|  21| 35000|
|          SPR|null| 35000|
|          SCF|  22| 30000|
|          ABC|  25|  null|
|          PQR|null|  null|
|          XYZ|  24|  null|
|         null|  25| 37000|
+-------------+----+------+

In [67]:
spark_df.show()

+-------------+----+------+
|         Name| Age|Salary|
+-------------+----+------+
|Prakash Dahal|  21|  null|
|          SPR|null| 35000|
|          SCF|  22| 30000|
|          ABC|  25|  null|
|          PQR|null|  null|
|          XYZ|  24|  null|
|         null|  25| 37000|
+-------------+----+------+

In [106]:
spark_df.select([when(isnull(c),c).alias(c) for c in spark_df.columns]).show()

+----+----+------+
|Name| Age|Salary|
+----+----+------+
|null|null|Salary|
|null| Age|  null|
|null|null|  null|
|null|null|Salary|
|null| Age|Salary|
|null|null|Salary|
|Name|null|  null|
+----+----+------+

In [71]:
#Counting the null values in all columns
spark_df.select([count(when(isnull(c),c)).alias(c) for c in spark_df.columns]).show()

+----+---+------+
|Name|Age|Salary|
+----+---+------+
|   1|  2|     4|
+----+---+------+

In [83]:
spark_df.dtypes

[('Name', 'string'), ('Age', 'int'), ('Salary', 'int')]

In [99]:
dict(spark_df.dtypes)['Name']

'string'

In [101]:
#Replace null values based on columns dtypes
spark_df.select([when(isnull(c), "Unknown").otherwise(spark_df[c]).alias(c)  for c in spark_df.columns]).show()

+-------------+-------+-------+
|         Name|    Age| Salary|
+-------------+-------+-------+
|Prakash Dahal|     21|Unknown|
|          SPR|Unknown|  35000|
|          SCF|     22|  30000|
|          ABC|     25|Unknown|
|          PQR|Unknown|Unknown|
|          XYZ|     24|Unknown|
|      Unknown|     25|  37000|
+-------------+-------+-------+

In [105]:
#Filter command
spark_df.filter(spark_df['Salary']>30000).show()

+----+----+------+
|Name| Age|Salary|
+----+----+------+
| SPR|null| 35000|
|null|  25| 37000|
+----+----+------+

In [111]:
#And operations

spark_df.filter((spark_df['Salary']>30000) & (spark_df['Age']>22)).show()

+----+---+------+
|Name|Age|Salary|
+----+---+------+
|null| 25| 37000|
+----+---+------+

In [116]:
#Row 0, column 0 value
spark_df.collect()[0][0]

'Prakash Dahal'

In [117]:
#Row 0, column 1 value
spark_df.collect()[0][1]

21

## GroupBy and Aggregate functions

In [118]:
spark_df.groupBy("Name").sum().show()

+-------------+--------+-----------+
|         Name|sum(Age)|sum(Salary)|
+-------------+--------+-----------+
|Prakash Dahal|      21|       null|
|         null|      25|      37000|
|          SPR|    null|      35000|
|          PQR|    null|       null|
|          XYZ|      24|       null|
|          ABC|      25|       null|
|          SCF|      22|      30000|
+-------------+--------+-----------+

In [122]:
spark_df.agg({"Age":"max"}).show()

+--------+
|max(Age)|
+--------+
|      25|
+--------+

## MLib